app/services/shortener.rb

INSERT INTO "links" ("lookup_code", "original_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["lookup_code", "7867d9a"], ["original_url", "test"], ["created_at", "2022-03-03 13:14:05.074820"], ["updated_at", "2022-03-03 13:14:05.074820"]]
---
    def generate_short_link
        link_model.create(original_url: url, lookup_code: lookup_code)